Repository: CudaText-addons/cuda_macros
Catalog: lang/*/LC_MESSAGES/cuda_macros.po
Languages: ru_ru

source: &Macros...
ru_ru: &Макросы...

source: &Start record
ru_ru: &Начать запись...

source: St&op record
ru_ru: Закон&чить запись

source: &Cancel record
ru_ru: &Отменить запись

source: &Export...
ru_ru: &Экспорт...

source: &Import...
ru_ru: &Импорт

source: &Run
ru_ru: &Запустить

source: Need update CudaText
ru_ru: Требуется обновление CudaText

source: No macros for export
ru_ru: Не выбраны макросы для экспорта

source: Export &to
ru_ru: Экспортировать &в

source: Check &all
ru_ru: Выбрать вс&е

source: U&ncheck all
ru_ru: Сн&ять выбор

source: &Export
ru_ru: &Экспорт

source: Close
ru_ru: Закрыть

source: Export macros
ru_ru: Экспорт макросов

source: Select some names
ru_ru: Укажите имена

source: No macros in file {} Choose another file?
ru_ru: Не найдены макросы {} Выбрать другой файл?

source: Macros from
ru_ru: Макросы из

source: are recorded in CudaText with version
ru_ru: записаны в CudaText другой версии

source: Your CudaText has older version
ru_ru: Ваш CudaText имеет более старую версию

source: No guarantee of correct working!
ru_ru: Корректная работа не гарантируется!

source: Continue import?
ru_ru: Продолжить импорт?

source: Import &from
ru_ru: Импорт и&з

source: &Import
ru_ru: &Импорт

source: Import macros
ru_ru: Импорт макросов

source: Import macros:
ru_ru: Макросы для импорта:

source: Skip duplicates:
ru_ru: Пропускать дубли:

source: &Stop record
ru_ru: Закон&чить запись

source: &View actions
ru_ru: &Просмотр действий

source: Hot&keys...
ru_ru: Со&четания...

source: Re&name...
ru_ru: П&ереименовать...

source: &Delete...
ru_ru: &Удалить...

source: &Run!
ru_ru: &Запустить!

source: &Times
ru_ru: П&овторы

source: &Wait
ru_ru: О&жидать

source: sec
ru_ru: сек

source: While text c&hanges
ru_ru: По&ка изменяется текст

source: Until c&aret on last line
ru_ru: Пока каретка &до посл.строки

source: Canc&el record
ru_ru: &Отменить запись

source: Ad&just...
ru_ru: Подстроит&ь...

source: Macros
ru_ru: Макросы

source: Custom dialog Macros
ru_ru: Подстройка диалога Макросы

source: Height of macro list (min 450)
ru_ru: Высота списка макросов (мин 450)

source: Width of macro list (min 200)
ru_ru: Ширина списка макросов (мин 200)

source: Width of action list (min 200, <=0-hide)
ru_ru: Ширина списка действий (мин 150, <=0-спрятать)

source: Width of buttons (min 150)
ru_ru: Ширина кнопок (мин 150)

source: Max run times (min 100)
ru_ru: Максимально число повторов (мин 100)

source: Select macro
ru_ru: Укажите макрос

source: New name for: {}
ru_ru: Новое имя для: {}

source: Select other name. Macro names now are:
ru_ru: Укажите другое имя. Уже использованные имена:

source: Delete macro {}
ru_ru: Удалить макрос {}

source: Select stop condition
ru_ru: Укажите условие остановки

source: Empty record
ru_ru: Пустая запись

source: Macro name. Tricks: "!NM" overwrite NM, "=NM" show NM in dialog
ru_ru: Имя макроса. Спец.знаки: "!NM" заменит NM, "=NM" откроет NM в диалоге

source: Select other name. Macros names now:
ru_ru: Укажите другое имя. Уже использованные имена:

source: No macros: {}
ru_ru: Нет макросов: {}

source: Wait &another {} sec
ru_ru: Ждать е&ще {} сек

source: Continue &without control
ru_ru: Продолжить выполнение без контроля

source: &Cancel playback [ESC]
ru_ru: &Отменить выполнение [Esc]

source: Playback macro
ru_ru: Выполнить макрос
